Table of Contents
 Class RebarBase
Namespace
IdeaRS.OpenModel.Model
Assembly
IdeaRS.OpenModel.dll
Represents a base class for Rebars in 3D space.
public abstract class RebarBase : OpenElementId
Inheritance
object
OpenObject
OpenElementId
RebarBase
Derived
RebarGeneral
RebarSingle
RebarStirrups
Inherited Members
 OpenElementId.Id
 object.Equals(object)
 object.Equals(object, object)
 object.GetHashCode()
 object.GetType()
 object.MemberwiseClone()
 object.ReferenceEquals(object, object)
 object.ToString()
Properties
 Diameter
Gets or sets the Rebar Diameter.
public double Diameter { get; set; }
Property Value
double
 GroupId
identity for group identification number
public int GroupId { get; set; }
Property Value
int
 Material
Gets or sets the reference of material properties.
public ReferenceElement Material { get; set; }
Property Value
ReferenceElement
 RebarAllocationElement
the element where this rebar belongs (part of that beam)
public ReferenceElement RebarAllocationElement { get; set; }
Property Value
ReferenceElement
 RebarParentElement
Gets or sets the reference element of the geometry of the reference line (line along which the rebars are generated). It can be IdeaRS.OpenModel.Geometry3D.Segment3D or IdeaRS.OpenModel.Geometry3D.PolyLine3D or IdeaRS.OpenModel.Model.Member1D or IdeaRS.OpenModel.Model.Element1D
public ReferenceElement RebarParentElement { get; set; }
Property Value
ReferenceElement
 RebarShape
Gets or sets the geometrical shape of the rebar. IdeaRS.OpenModel.Model.RebarShape
public ReferenceElement RebarShape { get; set; }
Property Value
ReferenceElement
 Edit this page